package jungol;

import java.util.Scanner;
import java.util.StringTokenizer;

public class C1733_3 {
	static String input1 = "0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 1 2 0 0 2 2 2 1 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 1 2 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 1 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 1 2 2 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 2 1 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0";
	static String input2 = "0 0 0 0 0 2 0 0 0 0 0 0 0 0 0 0 0 0 0 \r\n" + 
			"0 0 2 1 0 1 1 2 2 2 1 0 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 2 1 0 0 1 2 2 2 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 1 2 1 1 1 1 2 0 0 0 2 0 0 0 \r\n" + 
			"0 0 0 0 1 1 1 1 0 2 1 1 1 1 2 0 0 0 0 \r\n" + 
			"0 0 0 0 0 2 0 1 0 2 0 1 2 2 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 2 2 0 0 1 2 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 2 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 1 2 1 2 1 2 1 2 1 2 1 2 1 2 1 2 \r\n" + 
			"0 0 0 1 2 1 2 1 2 1 2 1 2 1 2 1 2 1 2 \r\n" + 
			"0 0 1 2 1 2 1 2 1 2 1 2 1 2 1 2 1 2 0 \r\n" + 
			"0 1 2 1 2 1 2 1 2 1 2 1 2 1 2 1 2 0 0 \r\n" + 
			"1 2 1 2 1 2 1 2 1 2 1 2 1 2 1 2 0 0 0 ";	//2 8 12
	static String input3 = "0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 2 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 1 1 2 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 2 0 2 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 2 0 0 0 2 0 2 0 2 0 0 0 0 0 \r\n" + 
			"0 0 0 0 1 1 1 2 1 2 0 0 2 0 0 0 0 0 0 \r\n" + 
			"0 0 0 1 2 0 0 1 0 2 1 2 0 0 0 0 0 0 0 \r\n" + 
			"0 0 1 2 0 0 0 0 1 1 2 1 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 2 1 1 0 0 0 0 0 2 0 0 \r\n" + 
			"0 0 0 0 0 0 0 2 0 2 0 1 0 0 0 0 2 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 2 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 0 0 \r\n" + 
			"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 0 0 \r\n" + 
			"0 1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 2 0 0"; //0
	public static void main(String[] args) {
//		Scanner sc= new Scanner(System.in);
		Scanner sc= new Scanner(input3);
		StringTokenizer st;
		
		int ans = 0;		//정답 (1, 2, 0)
		int r = 0; 		//첫 돌의 r
		int c = 0;		//첫 돌의 c
		
		//맵 작성
		int[][] map = new int[19][19];
		for(int i = 0 ;i < 19 ; i++) {
			st = new StringTokenizer(sc.nextLine());
			for(int j = 0 ; j < 19 ; j++) {
				map[i][j] = Integer.parseInt(st.nextToken());
			}
		}
		
		//팔방탐색용 델타(중 [i][j]가 첫 돌이 될 수 있는 방향으로만)
		int[] dr = {-1, 0, 1, 1};
		int[] dc = {1, 1, 1, 0};
		int[] dr2 = {1, 0, -1, -1};
		int[] dc2 = {-1, -1, -1, 0};

		
		outer : for(int i = 0 ; i < 19 ; i++) {	//시작점의 r
			for(int j = 0 ; j < 19 ; j++) {	//시작점의 c
				int color = map[i][j];
				if(map[i][j] != 0) {
					for(int k = 0 ; k < 4 ; k++) {	//8방탐색용 for문
						int cnt = 0;	// 같은 색 나오는 갯수	
						int dri = i;	// r 확인하는 인덱스 
						int dci = j;	// c 확인하는 인덱스
						while(true) {//다른 색 나올 때 까지 계속 그 방향으로 가
							if(dri+dr[k] >= 19 || dri+dr[k] < 0 || dci+dc[k] >= 19 || dci+dc[k] < 0) {	//판 벗어나면
								break;	//멈춰
							}
							dri += dr[k];
							dci += dc[k];
							
							if(map[dri][dci] == color) cnt++;	//이어지면 카운트 더해줘라
							else break; //다른색 나오면 멈춰
							
							if(cnt > 4) break;	//카운트가 5부터는 멈춰!
						}
						if(cnt == 4) {	//이건 끝났다.. 하기 전에 뒤쪽에 더 있는지 확인해보자
							dri = i;
							dci = j;
							while(true) {
								if(dri+dr2[k] >= 19 || dri+dr2[k] < 0 || dci+dc2[k] >= 19 || dci+dc2[k] < 0) {	//판 벗어나면
									break;	//멈춰
								}
								dri += dr2[k];
								dci += dc2[k];
								
								if(map[dri][dci] == color) cnt++;	//이어지면 카운트 더해줘라
								else break; //다른색 나오면 멈춰
								
								if(cnt > 4) break;	//카운트가 5부터는 멈춰!
							}
							if(cnt == 4) {
								r = i;
								c = j;
								ans = color;
								break outer;
							}
						}
					}
				}
			}
		}
		System.out.println(ans);
		if(ans != 0) System.out.println((r+1)+" "+(c+1));
	}
}
